using System.Collections.Generic;

namespace Application1
{
	static class Hiragana
	{
		public static Dictionary<string, string> Combos = new Dictionary<string, string>
		{
			{"wa", "わ"}, {"ra", "ら"}, {"ya", "や"}, {"ma", "ま"}, {"ha", "は"}, {"na", "な"},
			{"ta", "た"}, {"sa", "さ"}, {"ka", "か"}, {"a", "あ"}, {"ri", "り"}, {"mi", "み"}, 
			{"hi", "ひ"}, {"ni", "に"}, {"chi", "ち"}, {"shi", "し"}, {"ki", "き"}, {"i", "い"}, 
			{"ru", "る"}, {"yu", "ゆ"}, {"mu", "む"}, {"fu", "ふ"}, {"nu", "ぬ"}, {"tsu", "つ"}, 
			{"su", "す"}, {"ku", "く"}, {"u", "う"}, {"re", "れ"}, {"me", "め"}, {"he", "へ"}, 
			{"ne", "ね"}, {"te", "て"}, {"se", "せ"}, {"ke", "け"}, {"e", "え"}, {"wo", "を"}, 
			{"ro", "ろ"}, {"yo", "よ"}, {"mo", "も"}, {"ho", "ほ"}, {"no", "の"}, {"to", "と"}, 
			{"so", "そ"}, {"ko", "こ"}, {"o", "お"}, {"pa", "ぱ"}, {"ba", "ば"}, {"da", "だ"}, 
			{"za", "ざ"}, {"ga", "が"}, {"pi", "ぴ"}, {"bi", "び"}, {"ji", "じ"}, {"gi", "ぎ"}, 
			{"pu", "ぷ"}, {"bu", "ぶ"}, {"dzu", "づ"}, {"zu", "ず"}, {"gu", "ぐ"}, {"pe", "ぺ"}, 
			{"be", "べ"}, {"de", "で"}, {"ze", "ぜ"}, {"ge", "げ"}, {"po", "ぽ"}, {"bo", "ぼ"}, 
			{"do", "ど"}, {"zo", "ぞ"}, {"go", "ご"}, {"pya", "ぴゃ"}, {"bya", "びゃ"}, {"ja", "じゃ"}, 
			{"gya", "ぎゃ"}, {"rya", "りゃ"}, {"mya", "みゃ"}, {"hya", "ひゃ"}, {"nya", "にゃ"}, 
			{"cha", "ちゃ"}, {"sha", "しゃ"}, {"kya", "きゃ"}, {"pyu", "ぴゅ"}, {"byu", "びゅ"}, 
			{"ju", "じゅ"}, {"gyu", "ぎゅ"}, {"ryu", "りゅ"}, {"myu", "みゅ"}, {"hyu", "ひゅ"}, 
			{"nyu", "にゅ"}, {"chu", "ちゅ"}, {"shu", "しゅ"}, {"kyu", "きゅ"}, {"pyo", "ぴょ"}, 
			{"byo", "びょ"}, {"jo", "じょ"}, {"gyo", "ぎょ"}, {"ryo", "りょ"}, {"myo", "みょ"}, 
			{"hyo", "ひょ"}, {"nyo", "にょ"}, {"cho", "ちょ"}, {"sho", "しょ"}, {"kyo", "きょ"} 
		};
	}
}
